In [1]:
#importing the libraries
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sb

In [2]:
#reading the data
df = pd.read_csv("../data/train_resampled.csv")

In [3]:
#checking the shape of data
df.shape

(692, 12)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 692 entries, 0 to 691
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Gender            692 non-null    float64
 1   Married           692 non-null    float64
 2   Dependents        692 non-null    float64
 3   Education         692 non-null    float64
 4   Self_Employed     692 non-null    float64
 5   LoanAmount        692 non-null    float64
 6   Loan_Amount_Term  692 non-null    float64
 7   Credit_History    692 non-null    float64
 8   Total_Income      692 non-null    float64
 9   Semiurban         692 non-null    float64
 10  Urban             692 non-null    float64
 11  Loan_Status       692 non-null    int64
dtypes: float64(11), int64(1)
memory usage: 65.0 KB

In [5]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,LoanAmount,Loan_Amount_Term,Credit_History,Total_Income,Semiurban,Urban,Loan_Status
0,1.0,0.0,0.0,1.0,0.0,132.2,360.0,1.0,5849.0,0.0,1.0,1
1,1.0,1.0,1.0,1.0,0.0,128.0,360.0,1.0,6091.0,0.0,0.0,0
2,1.0,1.0,0.0,1.0,1.0,66.0,360.0,1.0,3000.0,0.0,1.0,1
3,1.0,1.0,0.0,0.0,0.0,120.0,360.0,1.0,4941.0,0.0,1.0,1
4,1.0,0.0,0.0,1.0,0.0,141.0,360.0,1.0,6000.0,0.0,1.0,1

In [6]:
df2 = df.copy()

In [7]:
# After trying few different combinations of these new columns improved the results
df2['total_income_by_loanAmt'] = (df['Total_Income'] / df['LoanAmount'])**2
df2['Loan_Amount_Term_By_amt'] = df['LoanAmount'] / df['Loan_Amount_Term']

In [8]:
df2.head()

,Gender,Married,Dependents,Education,Self_Employed,LoanAmount,Loan_Amount_Term,Credit_History,Total_Income,Semiurban,Urban,Loan_Status,total_income_by_loanAmt,Loan_Amount_Term_By_amt
0,1.0,0.0,0.0,1.0,0.0,132.2,360.0,1.0,5849.0,0.0,1.0,1,1957.493517,0.367222
1,1.0,1.0,1.0,1.0,0.0,128.0,360.0,1.0,6091.0,0.0,0.0,0,2264.421448,0.355556
2,1.0,1.0,0.0,1.0,1.0,66.0,360.0,1.0,3000.0,0.0,1.0,1,2066.115702,0.183333
3,1.0,1.0,0.0,0.0,0.0,120.0,360.0,1.0,4941.0,0.0,1.0,1,1695.380625,0.333333
4,1.0,0.0,0.0,1.0,0.0,141.0,360.0,1.0,6000.0,0.0,1.0,1,1810.774106,0.391667

In [9]:
#Credit History is either valid(1) or invalid(0)
df2["Credit_History"] = round(df2["Credit_History"])

In [11]:
X = df2.drop(['Loan_Status'], axis=1)
y = df2['Loan_Status']

In [12]:
from sklearn.model_selection import train_test_split

In [13]:
X_train, X_val, y_train, y_val = train_test_split(X, y, test_size=0.2, random_state=42)

In [14]:
from sklearn.ensemble import RandomForestClassifier

In [15]:
rf = RandomForestClassifier()

In [16]:
rf.fit(X_train, y_train)

RandomForestClassifier()

In [17]:
rf.score(X_val,y_val)

0.8848920863309353

In [18]:
df2.to_csv("../data/train_engineered.csv", index=False)

## Test Data

In [19]:
test_df = pd.read_csv("../data/test_imputed.csv")

In [20]:
test_df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,LoanAmount,Loan_Amount_Term,Credit_History,Semiurban,Urban,Total_Income
0,LP001015,1.0,1.0,0.0,1.0,0.0,110.0,360.0,1.0,0.0,1.0,5720.0
1,LP001022,1.0,1.0,1.0,1.0,0.0,126.0,360.0,1.0,0.0,1.0,4576.0
2,LP001031,1.0,1.0,2.0,1.0,0.0,208.0,360.0,1.0,0.0,1.0,6800.0
3,LP001035,1.0,1.0,2.0,1.0,0.0,100.0,360.0,0.8,0.0,1.0,4886.0
4,LP001051,1.0,0.0,0.0,0.0,0.0,78.0,360.0,1.0,0.0,1.0,3276.0

In [21]:
test_df['total_income_by_loanAmt'] = (test_df['Total_Income'] / test_df['LoanAmount'])**2
test_df['Loan_Amount_Term_By_amt'] = test_df['LoanAmount'] / test_df['Loan_Amount_Term']

In [22]:
test_df.to_csv("../data/test_engineered.csv", index=False)